# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [102]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [103]:
baby_names=pd.read_csv("D:/github_repo/python-learning/pandas_exercises_with_data/data/baby_name.txt")

### Step 4. See the first 10 entries

In [104]:
baby_names.head(10)

   Unnamed: 0     Id      Name    Year Gender State  Count
0       11349  11350      Emma  2004.0      F    AK   62.0
1       11350  11351   Madison  2004.0      F    AK   48.0
2       11351  11352    Hannah  2004.0      F    AK   46.0
3       11352  11353     Grace  2004.0      F    AK   44.0
4       11353  11354     Emily  2004.0      F    AK   41.0
5       11354  11355   Abigail  2004.0      F    AK   37.0
6       11355  11356    Olivia  2004.0      F    AK   33.0
7       11356  11357  Isabella  2004.0      F    AK   30.0
8       11357  11358    Alyssa  2004.0      F    AK   29.0
9       11358  11359    Sophia  2004.0      F    AK   28.0

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [105]:
del baby_names['Unnamed: 0']
del baby_names['Id']
baby_names.head()

      Name    Year Gender State  Count
0     Emma  2004.0      F    AK   62.0
1  Madison  2004.0      F    AK   48.0
2   Hannah  2004.0      F    AK   46.0
3    Grace  2004.0      F    AK   44.0
4    Emily  2004.0      F    AK   41.0

### Step 6. Is there more male or female names in the dataset?

In [106]:
baby_names['Gender'].value_counts()

F    110946
M     80294
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [107]:
names=baby_names.groupby('Name').sum()
del names['Year']#年份不需要相加，删掉Year列
names.head()

        Count
Name
Aadan    18.0
Aaden   789.0
Aadhav    6.0
Aadhya  126.0
Aadi    104.0

### Step 8. How many different names exist in the dataset?

In [108]:
len(baby_names['Name'].unique())

12914

### Step 9. What is the name with most occurrences?

In [109]:
#baby_names['Name'].count.max()
names.Count.idxmax()

'Isabella'

### Step 10. How many different names have the least occurrences?

In [110]:
len(names[names.Count==names.Count.min()])

1

### Step 11. What is the median name occurrence?

In [113]:
#baby_names[baby_names.count==baby_names.Count.median()]
names[names['Count']==names.Count.median()]

           Count
Name
Aitana      39.0
Akari       39.0
Alexsa      39.0
Alister     39.0
Alyn        39.0
Anas        39.0
Annel       39.0
Antwone     39.0
Arrow       39.0
Ayda        39.0
Brizeida    39.0
Cattaleya   39.0
Delaila     39.0
Delphine    39.0
Dru         39.0
Eathan      39.0
Esabella    39.0
Farid       39.0
Frederic    39.0
Iran        39.0
Jaylie      39.0
Jedediah    39.0
Kaiah       39.0
Kamia       39.0
Khali       39.0
Kunal       39.0
Laiba       39.0
Leonora     39.0
Leyton      39.0
Lilianne    39.0
Mailee      39.0
Mars        39.0
Mattix      39.0
Mili        39.0
Nareh       39.0
Nisa        39.0
Ollie       39.0
Orianna     39.0
Oryan       39.0
Passion     39.0
Prudence    39.0
Rayana      39.0
Rhiley      39.0
Rhyder      39.0
Robinson    39.0
Saiya       39.0
Shiann      39.0
Sonora      39.0
Sylis       39.0
Uzziah      39.0
Viana       39.0
Vittoria    39.0
Wolf        39.0
Yahira      39.0
Zipporah    39.0

### Step 12. What is the standard deviation of names?

In [114]:
names.Count.std()

2861.282660250301

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [122]:
print(names.Count.mean())
print(names.Count.min())
print(names.Count.max())
print(names.Count.std())
print(names.Count.quantile())

627.6505343038563
0.0
53020.0
2861.282660250301
39.0